import { NgFor, NgIf } from '@angular/common';
import { Component } from '@angular/core';


type Item = { title: string; description: string; points: string[] };

@Component({
  selector: 'app-responsibilities',
  imports: [NgFor, NgIf],
  templateUrl: './responsibilities.component.html',
  styleUrl: './responsibilities.component.css',
})
export class ResponsibilitiesComponent {
  selectedItem: Item | undefined;
  items: Item[] = [
    {
      title: 'שירותי ראיית חשבון',
      description: "ביצוע ביקורות על הדוחות הכספיים ומתן חוות דעת על פעילותכם אלה רק חלק מהדברים שנדרשים על ידי בעל עסק. רואה חשבון מקצועי יוכל לערוך לכם תשקיף בדבר הוצאות צפויות יחד עם ההכנסות כך שהעסק שלכם ינוהל בצורה יעילה ורווחית. שירותי ראיית החשבון במשרדינו נועדו לתת מענה פיננסי לארגון שלכם בין אם זה חברה, עצמאי או מלכר. אנו מתמקדים בפתרונות ראיית חשבון וביקורת לצרכיו הספציפיים של כל לקוח בהתאם לסוג וגודל העסק. זאת דרך התאמת הפתרון המתאים ביותר על ידי כך שאנו לומדים להבין בצורה מקצועית את המצב הכספי והפעולות הקשורות למבנה העסקי המורכב, בסביבה הפיננסית והמשפטית.",
      points: [
        'ביקורת חיצונית ביקורת פנימית',
        'תכנון פיננסי של מודלים חשבונאים',
        'מאזנים ודוחות כספיים',
        'ניתוח סיכונים פיננסיים',
        'הכנת מאזן שנתי',
        'חוות דעת מקצועית הצהרות הון',
        'הכנת דוחות שנתיים לשלטונות המס לחברות, לעצמאים ושכירים',
        'ייעוץ תמחירי (חשבונאות ניהולית)',
        "בדיקות נאותות חשבונאית (דיו דיליג'נס)",
      ],
    },
    {
      title: 'הנהלת חשבונות',
      description: '"הנהלת חשבונות תקינה היא הרבה מעבר לחישוב ורישום של הכנסות והוצאות העסק; היא כלי חיוני לניהול השוטף והתקין של כל עסק. משרדנו מציע שירותי הנהלת חשבונות מגוונים, הכוללים הן הנהלת חשבונות כפולה והן חד-צידית. אנו מספקים את השירותים לכל סוגי העסקים, כולל עצמאים, חברות ומלכ"רים, ומבצעים התאמה אישית של הפעילות לפי צרכי הלקוח והיקף העסק. הנהלת החשבונות ניתנת הן ללקוחות המשרד והן כשירות עצמאי ללקוחות המנהלים את חשבונותיהם באופן עצמאי."',
      points: [
        'חשבות שכר',
        'הכנת תלושי שכר לעובדי העסק כולל סיוע בהפקת דוחות שכר שנתיים',
        'דיווח לרשויות המס',
        'הכנת דוחות רווח והפסד חודשיים או רבעוניים',
        'רישום פעילויות החברה והפקת דוחות',
        'ניהול ספרי העסק באופן ממוחשב ייעוץ שוטף וזמין מצוות הנהלת החשבונות',
      ],
    },
    {
      title: 'ליווי עסקי ופיננסי',
      description: '"הקמת פעילות עסקית חדשה ואף תפעול של עסק קיים מצריך מגוון שירותים פיננסיים. לצד ניהול העסק יש לנהל היטב גם את הכספים, למשל: ניהול אשראי של ספקים ולקוחות, ניהול תזרים מזומנים שוטף, ותכנון תזרים מזומנים עתידי. כמו כן, נדרש להעריך את ההשקעות הנדרשות וצרכי ההון החוזר. הליווי הפיננסי מסייע למקסם את רווחיות העסק ואף עוזר להשיג מימון חיצוני לפעילות העסק ביתר קלות. בתהליך הליווי העסקי והפיננסי, אמיר רוזנברג, מייסד המשרד, יושב עם הלקוח על מנת ללמוד אודות העסק ואת כל הפרטים הרלוונטיים לבניית תוכנית עסקית אופטימלית, בהתאם לצרכי הלקוח ובהתאם לסוג העסק."',
      points: [
        'ניהול כספים חיצוני',
        'הכנת תוכנית עסקית או פיננסית',
        'ניהול תזרים מזומנים',
        'גיוס מימון בנקאי וחוץ בנקאי בדיקת כדאיות כלכלית',
        'הערכת שווי',
      ],
    },
    {
      title: 'שירותי ייעוץ מס',
      description: '"חוקי המס בישראל מורכבים ומשתנים לעיתים קרובות, ולכל עסק סביבת מיסוי ייחודית משלו. עקב כך, ייתכן שדרישות חוק או הטבות מס החלות על עסק מסוים, אינן חלות על עסק אחר. הממשק הצמוד של עסק עם רשויות המס הינן גורם מרכזי ומהותי בניהול עסק ומתבטאת בביצוע דיווחים שוטפים ושונים לכל אחת מהרשויות (מס הכנסה, מע"מ, וביטוח לאומי) ובערכת חוקים החלה על כללי הנהלת חשבונות, השכר והמס של העסק. בשל מורכבות הנושא והשינויים הרבים הנעשים בחקיקה ופסיקה, שומר המשרד על רמה מקצועית עדכנית ויצירתית במטרה לספק שירות איכותי, מקצועי ומיטבי ללקוחות."',
      points: [
        'תכנון והערכות מס שמטרתן הפחתה לגיטימית של נטל המס',
        'ייצוג בדיוני שומות במס הכנסה, במס ערך מוסף בביטוח לאומי ובניכויים',
        'סיוע בהכנת דיווחים לרשויות המס השונות',
        'ליווי וייעוץ לעסקאות',
        'סיוע בהכנה והגשה של דוחות המס השנתיים לרשויות המס בישראל',
        'הכנת הצהרות הון',
        'דיווחים שוטפים לרשוית המס',
        'החזרי מס לשכירים',
      ],
    },
    {
      title: 'שירותי גישור',
      description: '"הגישור הינו תהליך של יצירת גשר בין צדדים אשר קיימת ביניהם מחלוקת על מנת להגיע לעמק השווה ולמצוא את נקודות ההסכמה שיביאו לסיום הסכסוך והמחלוקת. מגשר מוסמך חייב להיות ניטראלי וללא אינטרס בתועלת שתצא למי מהצדדים הנמצאים במחלוקת. על המגשר להיות אדם אמפתי בעל יחסי אנוש ויחד עם זאת אדם מעשי ויצירתי שיוכל להגיע לפתרון המתאים שיסיים את הסכסוך. אנו מאמינים כי שיח ותקשורת הן הדרכים הטובות והנכונות ביותר ליישוב מחלוקות. התהליך נעשה על ידי אמיר רוזנברג, מגשר מוסמך שיביא לידי ביטוי את קולו של כל אחד מהצדדים תוך מתן הכוונה ואוזן קשבת ואובייקטיבית על מנת להגיע לפתרון הוגן תוך הסכמה הדדית."',
      points: [
        'הליך גירושים',
        'סכסוכי ירושה',
        'מחלוקות עבודה',
        'אי הסכמה עסקית',
        'סכסוך שכנים',
      ],
    },
  ];

  selectItem(item: Item) {
    this.selectedItem = item;
  }
}
